1. Завантажити та встановити [MySQL installer](https://dev.mysql.com/downloads/installer/)
1.1 З [MySQL installer][link1] установити MySQL server та MySQL workbench
1.2 Додати до [PATH][link2]
1.3 Через `cmd` [ввести][link3] `mysql --user=root --password=Зкгпдщ_1059863`

2. https://proglib.io/p/python-i-mysql-prakticheskoe-vvedenie-2021-01-06

[link1]: https://youtu.be/NJdZYX0zdVM
[link2]: https://youtu.be/eq-e_n7lm2M
[link3]: https://stackoverflow.com/questions/23950722/how-to-overcome-error-1045-28000-access-denied-for-user-odbclocalhost-u

In [3]:
#!pip install mysql-connector-python

In [1]:
import mysql.connector

In [2]:
USER = 'root'
PASSWORD = 'Зкгпдщ_1059863'

In [3]:
# from getpass import getpass
from mysql.connector import connect, Error

try:
    with connect(
        host="localhost",
        user = USER,
        password = PASSWORD,
    ) as connection:
        print(connection)
except Error as e:
    print(e)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001E24377B8E0>

# Виконаємо запит `SHOW DATABASES`, щоб побачити всі бази данних, що є на локальному MySQL сервері:

In [4]:
try:
    with connect(
        host="localhost",
        user = USER,
        password = PASSWORD,
    ) as connection:
        show_db_query = "SHOW DATABASES"
        with connection.cursor() as cursor:
            cursor.execute(show_db_query)
            for db in cursor:
                print(db)
except Error as e:
    print(e)

('information_schema',)
('mysql',)
('performance_schema',)
('sys',)
('world',)

Наведений код виведе імена всіх баз даних, що знаходяться на сервері MySQL. Команда `SHOW DATABASES` у нашому прикладі також вивела бази даних, які автоматично створюються сервером MySQL і надають доступ до метаданих баз даних та налаштувань сервера.

# Підключення до існуючої бази даних

In [5]:
try:
    with connect(
        host="localhost",
        user = USER,
        password = PASSWORD,
        database="information_schema",
    ) as connection:
        print(connection)
except Error as e:
    print(e)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001E24365A830>

# Завантажемо сторонню базу даних

C:\Users\GbreH>mysql --user=USER --password=PASSWORD < "C:\\Users\\GbreH\\Desktop\\sample-mysql-db-master\\sample-mysql-db-master\\world\\world.sql"

mysql: [Warning] Using a password on the command line interface can be insecure.


<!-- mysql.exe --defaults-file="C:\Users\GbreH\AppData\Local\Temp\tmp4_c6vo_6.cnf"  --protocol=tcp --host=localhost --user=root --port=3306 --default-character-set=utf8 --comments --database=world  < "C:\\Users\\GbreH\\Desktop\\sample-mysql-db-master\\sample-mysql-db-master\\world\\world.sql" -->

[Отримати список таблиць у користувацьких базах даних в SQL Server](https://ru.stackoverflow.com/questions/19340/%D0%9F%D0%BE%D0%BB%D1%83%D1%87%D0%B8%D1%82%D1%8C-%D1%81%D0%BF%D0%B8%D1%81%D0%BE%D0%BA-%D1%82%D0%B0%D0%B1%D0%BB%D0%B8%D1%86-%D0%B2-%D0%BF%D0%BE%D0%BB%D1%8C%D0%B7%D0%BE%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D1%81%D0%BA%D0%B8%D1%85-%D0%91%D0%94-%D0%B2-sql-server)

[some link](https://stackoverflow.com/questions/64610085/why-am-i-getting-unhandled-exception-local-variable-pwd-referenced-before-as)

[Як експортувати та імпортувати базу даних у MySQL Workbench](https://youtu.be/Rka9SUx6bl0)

In [6]:
try:
    with connect(
        host="localhost",
        user = USER,
        password = PASSWORD,
        database="world",
    ) as connection:
        show_tb_query = "SHOW TABLES"
        with connection.cursor() as cursor:
            cursor.execute(show_tb_query)
            for db in cursor:
                print(db)
except Error as e:
    print(e)

('city',)
('country',)
('country_language',)

In [68]:
def query(query_text):
    try:
        with connect(
            host="localhost",
            user = USER,
            password = PASSWORD,
            database="world",
        ) as connection:
            with connection.cursor() as cursor:
                cursor.execute(query_text)
                for db in cursor:
                    print(db)
    except Error as e:
        print(e)

In [12]:
query("SELECT * FROM city LIMIT 10") # LIMIT вказує на кількість виведених рядків

(1, 'Kabul', 'AFG', 'Kabol', 1780000)
(2, 'Qandahar', 'AFG', 'Qandahar', 237500)
(3, 'Herat', 'AFG', 'Herat', 186800)
(4, 'Mazar-e-Sharif', 'AFG', 'Balkh', 127800)
(5, 'Amsterdam', 'NLD', 'Noord-Holland', 731200)
(6, 'Rotterdam', 'NLD', 'Zuid-Holland', 593321)
(7, 'Haag', 'NLD', 'Zuid-Holland', 440900)
(8, 'Utrecht', 'NLD', 'Utrecht', 234323)
(9, 'Eindhoven', 'NLD', 'Noord-Brabant', 201843)
(10, 'Tilburg', 'NLD', 'Noord-Brabant', 193238)

In [13]:
query('SHOW COLUMNS FROM world.city;') # Подивитись на колонки що є в таблиці

('id', b'int', 'NO', 'PRI', None, 'auto_increment')
('name', b'char(35)', 'NO', '', b'', '')
('country_code', b'char(3)', 'NO', 'MUL', b'', '')
('district', b'char(20)', 'NO', '', b'', '')
('population', b'int', 'NO', '', b'0', '')

In [41]:
query('SHOW COLUMNS FROM city;')

('id', b'int', 'NO', 'PRI', None, 'auto_increment')
('name', b'char(35)', 'NO', '', b'', '')
('country_code', b'char(3)', 'NO', 'MUL', b'', '')
('district', b'char(20)', 'NO', '', b'', '')
('population', b'int', 'NO', '', b'0', '')

In [21]:
column = 'name'
unique_val_name = f"""SELECT COUNT(DISTINCT {column})
FROM city;"""
query(unique_val_name)
all_count_name = f"""
SELECT COUNT({column})
FROM city;"""
query(all_count_name)

(3998,)
(4079,)

In [22]:
column = 'country_code'
unique_val_name = f"""SELECT COUNT(DISTINCT {column})
FROM city;"""
query(unique_val_name)
all_count_name = f"""
SELECT COUNT({column})
FROM city;"""
query(all_count_name)

(232,)
(4079,)

In [23]:
column = 'district'
unique_val_name = f"""SELECT COUNT(DISTINCT {column})
FROM city;"""
query(unique_val_name)
all_count_name = f"""
SELECT COUNT({column})
FROM city;"""
query(all_count_name)

(1367,)
(4079,)

In [24]:
column = 'population'
unique_val_name = f"""SELECT COUNT(DISTINCT {column})
FROM city;"""
query(unique_val_name)
all_count_name = f"""
SELECT COUNT({column})
FROM city;"""
query(all_count_name)

(3897,)
(4079,)

In [58]:
q = """select name, district, count(district)
from city
group by population;
having count(population) > 20;
"""# having count(population) > 20;
query(q)

TypeError: 'str' object is not callable

In [65]:
# Importing data from a MySQL database into Pandas data frame
import pandas as pd
try:
    mydb = connect(host="localhost", database = 'world',user=USER, passwd=PASSWORD,use_pure=True)
    query = "Select * from city;"
    result_dataFrame = pd.read_sql(query,mydb)
    mydb.close() #close the connection
except Exception as e:
    mydb.close()
    print(str(e))

C:\Users\GbreH\Desktop\jupyter\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [66]:
result_dataFrame

        id            name country_code       district  population
0        1           Kabul          AFG          Kabol     1780000
1        2        Qandahar          AFG       Qandahar      237500
2        3           Herat          AFG          Herat      186800
3        4  Mazar-e-Sharif          AFG          Balkh      127800
4        5       Amsterdam          NLD  Noord-Holland      731200
...    ...             ...          ...            ...         ...
4074  4075      Khan Yunis          PSE     Khan Yunis      123175
4075  4076          Hebron          PSE         Hebron      119401
4076  4077        Jabaliya          PSE     North Gaza      113901
4077  4078          Nablus          PSE         Nablus      100231
4078  4079           Rafah          PSE          Rafah       92020

[4079 rows x 5 columns]

In [67]:
df = result_dataFrame
df.country_code.nunique()

232

In [69]:
q = """Select COUNT(DISTINCT country_code) from city LIMIT 100;"""
query(q) # COUNT(DISTINCT country_code)

(232,)

In [76]:
q = """Select name DISTINCT(country_code) from city
GROUP BY country_code
having country_code"""
query(q) # COUNT(DISTINCT country_code)

1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'DISTINCT(country_code) from city
GROUP BY country_code
having country_code' at line 1